import { ImageInterface } from './ImageInterface';

/**
 * Список интересных фактов
 * */
export const ImagesList: ImageInterface[] = [
  {
    id: 1,
    title: 'Египетские пирамидым',
    src: '/src/assets/img/img1.webp',
    description:
      'Пирамиды — единственное чудо из заветной семёрки, сохранившееся до наших дней. Оно же и самое древнее: возраст трёх великих пирамид, которыми восхищались греки и продолжаем поражаться мы, — фараонов Хеопса, Хефрена и Микерина — около пяти тысяч лет. Эти колоссальные сооружения пока неподвластны влиянию времени. Самая громадная — пирамида Хеопса — высотой 147метров сложена из 2 300 000 глыб известняка, каждая из них весом около двух тонн.\n' +
      '\n' +
      'Пирамиды служили усыпальницами царям Египта и строились задолго до их смерти в течение десятков лет. Как это происходило в точности — неизвестно. Одни историки говорят, что строителями были бесправные рабы, другие — что на возведении пирамид за кормление трудились египетские крестьяне, сменявшие друг друга каждые три месяца. До сих пор неизвестно также в точности, каким способом втаскивали гигантские глыбы наверх по мере роста пирамиды. Какой-либо техникой, кроме блоков и рычагов, строители в то время не располагали. Кто-то из исследователей предположил даже, что затаскивали блоки по специальным насыпям из песка — и если это действительно было так, то общий объём проделанных работ колоссально возрастает… Как бы то ни было, работа гигантская и удивительно точная: блоки сложены так, что между соседними не втиснется лезвие ножа. С точки зрения современного человека, пирамиды бессмысленны, зато величественны, прекрасны и совершенны. Поэтому и сегодня они неизменно поражают всех, кто их видит.\n',
  },
  {
    id: 2,
    title: 'Сады Семирамиды (висячие сады Вавилона)',
    src: '/src/assets/img/img2.webp',
    description:
      'Сады Семирамиды находились в древнем городе Вавилоне, но доказательств, что они существовали, нет. Однако это чудо света упоминали древнегреческие и римские историки.     По одной из теорий, Висячие сады Семирамиды построили в VI–VII веке до нашей эры для жены царя Навуходоносора II. Это был четырёхэтажный дворец высотой примерно 40 метров. Висячие сады выглядели как пирамида, с ярусов которой свисали тропические растения — кипарис, ива, миндаль, гранат и другие деревья.  Вместе с фонтанами и водоёмами сады создавали оазис. Чтобы поливать столько растений, спроектировали уникальную систему орошения, для которой требовалось несколько сотен рабов.  По одной из версий, Висячие сады Семирамиды разрушило землетрясение, по другой — наводнение, третья говорит, что виноваты персидские войска.',
  },
  {
    id: 2,
    title: 'Статуя Зевса в Олимпии',
    src: '/src/assets/img/img3.webp',
    description:
      'Статую построили в религиозном центре Древней Греции, Олимпии, по проекту древнегреческого архитектора Фидия примерно в 435 году до нашей эры. Ей украсили храм Зевса, одно из крупнейших сооружений того времени, полностью сделанное из мрамора. Сам Бог неба был выполнен из слоновой кости и золота и изображён сидящим на троне. Голову Зевса украшает оливковый венок, в руках он держит скипетр, а в другой — статую богини Победы Ники. Что стало с чудом света, точно не известно. По одной из версий, статуя Зевса сгорела вместе с храмом в 426 году нашей эры.',
  },
];
